app/controllers/conformidades_controller.rb

SELECT "conformidades".* FROM "conformidades"
---
  def index
    @conformidades = Conformidade.all

SELECT "conformidades".* FROM "conformidades" WHERE "conformidades"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @conformidade = Conformidade.find(params[:id])

SELECT "conformidades".* FROM "conformidades" WHERE "conformidades"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @conformidade = Conformidade.find(params[:id])

INSERT INTO "conformidades" ("caixa", "created_at", "data", "fornecedor_id", "observacao", "processo", "updated_at", "valor") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @conformidade = Conformidade.new(params[:conformidade])

    respond_to do |format|
      if @conformidade.save